amrdambreak/constant/phaseProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  sigma    0.07;


  R1         [0 2 -2 -1 0 0 0]   6934;
  Cp1        [0 2 -2 -1 0 0 0]   4186;
  molM1      [1 0 0 0 -1 0 0]    18e-03;

  rho01      [1 -3 0 0 0 0 0]    1000;
  rho1Min    [1 -3 0 0 0 0 0]    0.01;

  mu1        [1 -1 -1 0 0 0 0]   1e-3;
  Pr1        [0 0 0 0 0 0 0]     1;


  R2         [0 2 -2 -1 0 0 0]   287;
  Cp2        [0 2 -2 -1 0 0 0]   1004.5;
  molM2      [1 0 0 0 -1 0 0]    28.97e-03;

  rho02      [1 -3 0 0 0 0 0]    0;
  rho2Min    [1 -3 0 0 0 0 0]    0.01;

  mu2        [1 -1 -1 0 0 0 0]   1e-5;
  Pr2        [0 0 0 0 0 0 0]     1;

  Prt        [0 0 0 0 0 0 0]     1;

// ************************************************************************* //
